common/models/User.php

SELECT * FROM `tbl_user` WHERE (`id`='3') AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);